"use strict";

/*
//1. Цикл while
var i = 1; //счетчик цикла
while (i < 10) {
	alert(i);
		//С помощью оператора ++ увеличиваем i на единицу 
		// при каждом проходе цикла.

	i++;
}
*/

//2. Цикл for
/*
for ( начальные команды; условие окончания цикла; команды после прохода цикла ) {
	тело цикла
}
*/

/*
//3. Цикл for для массивов
var arr = [1, 2, 3, 4, 5];
for (var i = 0; i < arr.length; i++) {
	alert(arr[i]);
}
*/

/*
//4. Цикл for-in
//Для перебора объекта используется так называемый цикл for-in
var obj = {
	Коля: 200,
	Вася: 300,
	Петя: 400
};

for (var key in obj) {
	alert(key); //выведет ключи Коля, Вася, Петя
}

for (var key in obj) {
	alert(obj[key]); //выведет значения 200, 300, 400
}
*/